mounthes = {
        1: "Січня",
        2: "Лютого",
        3: "Березня",
        4: "Квітня",
        5: "Травня",
        6: "Червня",
        7: "Липня",
        8: "Серпня",
        9: "Вересня",
        10: "Жовтня",
        11: "Листопада",
        12: "Грудня"
}

numbers = {
        1: "Перше",
        2: "Друге",
        3: "Третє",
        4: "Четверте",
        5: "П'яте",
        6: "Шосте",
        7: "Сьоме",
        8: "Восьме",
        9: "Дев'яте",
        10: "Десяте",
        11: "Одинадцяте",
        12: "Дванадцяте",
        13: "Тринадцяте",
        14: "Чотирнадцяте",
        15: "П'ятнадцяте",
        16: "Шістнадцяте",
        17: "Сімнадцяте",
        18: "Вісімнадцяте",
        19: "Дев'ятнадцяте",
        20: "Двадцяте",
        21: "Двадцять перше",
        22: "Двадцять друге",
        23: "Двадцять третє",
        24: "Двадцять четверте",
        25: "Двадцять п'яте",
        26: "Двадцять шосте",
        27: "Двадцять сьоме",
        28: "Двадцять восьме",
        29: "Двадцять дев'яте",
        30: "Тридцяте",
        31: "Тридцять перше"
}

while True:
    day = int(input("Введіть номер дня (Приклад: 01): "))
    month = int(input("Введіть номер місяця (Приклад: 09):"))
    year = int(input("Введіть рік (Приклад: 2000): "))
    february_days = 29 if year % 4 == 0 and year % 100 != 0 or year % 400 == 0 else 28
    if day < 0 or day > 31 or month < 1 or month > 12 or year < 0 or (day > february_days and month == 2):
        print("Не існує такого дня/місяця цього року")
    else:
        print(f"{numbers.get(day, 'Unknown')} {mounthes.get(month, 'Unknown')} {year}-ого року")
    print("Дія виконана, продовжити роботу?")
    pererv = input("1 - так, 0 - ні ")
    if pererv == "1":
        print("Программа перезапущена")
    elif pererv == "0":
        print("Программа зупинена")
        break
    else:
        print("На тебе програма обідилась, за те що ти не можешь нормально написати, тому вимикається! -_-")
        break